Revit 2024 API
Space.UnboundedHeight Property
Get the Unbounded Height of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double UnboundedHeight { get; }
Visual Basic
Public ReadOnly Property UnboundedHeight As Double
	Get
Visual C++
public:
property double UnboundedHeight {
	double get ();
}
Remarks
This property is used to get the Unbounded Height of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace